# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [1]:
import pandas as pd
df=pd.read_csv("D:\Download\Pandas Practice assignment\Pandas Practice assignment\Data\Purchase_Data.csv")
df.head()

<>:2: SyntaxWarning: invalid escape sequence '\D'
<>:2: SyntaxWarning: invalid escape sequence '\D'
C:\Users\Mariam\AppData\Local\Temp\ipykernel_13168\1438561812.py:2: SyntaxWarning: invalid escape sequence '\D'
  df=pd.read_csv("D:\Download\Pandas Practice assignment\Pandas Practice assignment\Data\Purchase_Data.csv")

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [5]:
df.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [49]:
result_1=df.loc[:,"invoice_time":"store_id"] 
result_1.head()

    invoice_time store_id
0  7/15/15 10:45     G816
1  7/15/15 12:16     G816
2  7/15/15 12:16     G816
3  7/15/15 12:16     G816
4  7/15/15 12:16     G816

Slice the first two rows using .loc and store the result in a variable called result_2.

In [45]:
result_2=df.loc[1:2]
result_2.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [57]:
result_3=df.iloc[0:4,0:5]
result_3.head()

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [62]:
result_4=df.loc[[0,4,6],["invoice_time","price"]]
result_4.head()

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [80]:
num_rows=df.shape[0] #shape normally displays the number of rows and columns while mentioning zero between brackets refers to rows number
print(num_rows)

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [96]:
print(df.loc[5381:])

      invoice_number  invoice_time store_id  product_id  category_id  \
5381    2.020000e+11  9/5/15 23:38     G619    23030206       210101

      num_item  price
5381       1.0    2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [110]:
avg_price=df.price.mean()
max_price=df.price.max()
print(f"Average Price: {avg_price}")
print(f"Max price: {max_price}")

Average Price: 3.1920522110741363
Max price: 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [114]:
avg_price, avg_num_items = df[['price', 'num_item']].mean()

print(f"Average Price: {avg_price}")
print(f"Average Number of Items: {avg_num_items}")

Average Price: 3.1920522110741363
Average Number of Items: 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [116]:
df["total"]=df["price"]*df["num_item"]
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [124]:
top_3_values = df[['price', 'num_item']].apply(lambda col: col.nlargest(3).values)

print(top_3_values)

   price  num_item
0   6.01     116.0
1   6.00      48.0
2   6.00      48.0

How many different products are there?

In [155]:
num_of_products=df["product_id"].nunique()
print(num_of_products)

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [165]:
stat=df.total.describe()
dff=stat['mean']-stat['50%']
print(f"The difference between the mean and median equals {dff}")

The difference between the mean and median equals 0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [181]:
df_data=df.drop('total',axis=1)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [196]:
df['invoice_time']=pd.to_datetime(df['invoice_time'])
df['date']=df['invoice_time'].dt.date
df['time']=df['invoice_time'].dt.time
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total,date,time
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,2.0,2015-07-15,10:45:00
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,2.0,2015-07-15,12:16:00
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,2.0,2015-07-15,12:16:00
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,6.0,2015-07-15,12:16:00
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,6.0,2015-07-15,12:16:00

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [198]:
df['invoice_time']=pd.to_datetime(df['invoice_time'])
df['DOW']=df['invoice_time'].dt.day
df['Month']=df['invoice_time'].dt.month
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total,date,time,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,2.0,2015-07-15,10:45:00,15,7
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,2.0,2015-07-15,12:16:00,15,7
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,2.0,2015-07-15,12:16:00,15,7
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,6.0,2015-07-15,12:16:00,15,7
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,6.0,2015-07-15,12:16:00,15,7

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [265]:
import pandas as pd
df=pd.read_csv("D:\Download\Pandas Practice assignment\Pandas Practice assignment\Data\Titanic.csv")
df.head()

<>:2: SyntaxWarning: invalid escape sequence '\D'
<>:2: SyntaxWarning: invalid escape sequence '\D'
C:\Users\Mariam\AppData\Local\Temp\ipykernel_13168\2350963502.py:2: SyntaxWarning: invalid escape sequence '\D'
  df=pd.read_csv("D:\Download\Pandas Practice assignment\Pandas Practice assignment\Data\Titanic.csv")

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [269]:
df=df.rename(columns={"Name":"Passenger_Name","Ticket":"Ticket_Num"})
df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [287]:
df=df.set_index('PassengerId')
df.head()

,level_0,index,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,,
892,0,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,1,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,2,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,3,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,4,4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [273]:
df.loc[df["PassengerId"] == 896, "Passenger_Name"]

4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
Name: Passenger_Name, dtype: object

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [289]:
df=df.reset_index()
df.head()

,PassengerId,level_0,index,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,0,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,2,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,3,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,4,4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [295]:
df.Age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
413     True
414    False
415    False
416     True
417     True
Name: Age, Length: 418, dtype: bool

Compute the avg age of passengers ignoring the missing data.

In [309]:
df.dropna(subset=["Age"])
avg=df.Age.mean()
print(f" The average of Ages : {avg}")

 The average of Ages : 30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [322]:
df["Age"] = df["Age"].fillna(df["Age"].mean())
df

,PassengerId,level_0,index,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,0,0,3,"Kelly, Mr. James",male,34.50000,0,0,330911,7.8292,NaN,Q
1,893,1,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.00000,1,0,363272,7.0000,NaN,S
2,894,2,2,2,"Myles, Mr. Thomas Francis",male,62.00000,0,0,240276,9.6875,NaN,Q
3,895,3,3,3,"Wirz, Mr. Albert",male,27.00000,0,0,315154,8.6625,NaN,S
4,896,4,4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.00000,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,413,413,3,"Spector, Mr. Woolf",male,30.27259,0,0,A.5. 3236,8.0500,NaN,S
414,1306,414,414,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,PC 17758,108.9000,C105,C
415,1307,415,415,3,"Saether, Mr. Simon Sivertsen",male,38.50000,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,416,416,3,"Ware, Mr. Frederick",male,30.27259,0,0,359309,8.0500,NaN,S
417,1309,417,417,3,"Peter, Master. Michael J",male,30.27259,1,1,2668,22.3583,NaN,C

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [325]:
df_sorted = df.sort_values(by="Age", ascending=False)
top_5_oldest = df_sorted.head(5)
avg_age_oldest = top_5_oldest["Age"].mean()
top_5_oldest.reset_index(drop=True, inplace=True)
print(f"The average age of the 5 oldest passengers: {avg_age_oldest}")

The average age of the 5 oldest passengers: 67.0